---
kind: property
id: P:Autodesk.Revit.DB.Electrical.Wire.HotConductorNum
source: html/8aee795d-931b-c13a-e4d5-bca5b01b724b.htm
---
# Autodesk.Revit.DB.Electrical.Wire.HotConductorNum Property

The hot conductor number. Its default value is zero after created.

## Syntax (C#)
```csharp
public int HotConductorNum { get; set; }
```